### Data Cleaning

In [57]:
import pandas as pd
import numpy
import sklearn
import matplotlib.pyplot as
titanic = pd.read_csv("The Titanic dataset.csv")

the_titanic = pd.read_csv("The Titanic dataset.csv")
# the_titanic = pd.read_csv("../datasets/The Titanic dataset.csv", header=1)


the_titanic.head(10)

SyntaxError: invalid syntax (1804389547.py, line 4)

In [ ]:
the_titanic.columns = the_titanic.iloc[0]
the_titanic_df= the_titanic[1:].reset_index(drop=True)
the_titanic_df

,sn,pclass,survived,NaN,gender,age,family,fare,embarked,date
0,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
1,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
2,2,3,0,Master. Eugene Joseph,male,?,2,20.25,S,02-Jan-90
3,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,NaN,2,**,S,03-Jan-90
4,4,3,1,"Abbott, Mr. Rossmore Edward",female,35,2,20.25,S,04-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1296,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24,0,13,S,19-Jul-93
1297,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1298,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1299,1299,3,0,"Zakarian, Mr. Ortin",male,27,0,7.225,C,22-Jul-93
1300,1300,3,0,"Zimmerman, Mr. Leo",male,29,0,7.875,S,23-Jul-93

In [ ]:
the_titanic_df.rename(columns={the_titanic.columns[3]: 'name'}, inplace=True)
# the_titanic['date'] = pd.to_datetime(the_titanic['date'])
the_titanic_df.drop_duplicates(inplace=True)
the_titanic_df

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
0,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
2,2,3,0,Master. Eugene Joseph,male,?,2,20.25,S,02-Jan-90
3,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,NaN,2,**,S,03-Jan-90
4,4,3,1,"Abbott, Mr. Rossmore Edward",female,35,2,20.25,S,04-Jan-90
5,5,3,1,"Abelseth, Miss. Karen Marie",female,16,0,7.65,S,05-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1296,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24,0,13,S,19-Jul-93
1297,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1298,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1299,1299,3,0,"Zakarian, Mr. Ortin",male,27,0,7.225,C,22-Jul-93
1300,1300,3,0,"Zimmerman, Mr. Leo",male,29,0,7.875,S,23-Jul-93

In [ ]:
the_titanic_df[['sn', 'pclass', 'survived', 'age', 'family', 'fare']].describe()
the_titanic_df.describe()

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
count,1300,1300,1300,1300,1299,1043,1298,1298,1295,1300
unique,1300,3,2,1297,2,97,9,282,3,1300
top,1,3,0,"Abbott, Mr. Rossmore Edward",male,24,0,13,S,01-Jan-90
freq,1,699,800,2,834,47,780,59,905,1

In [ ]:
non_numeric_values = pd.to_numeric(the_titanic_df['age'], errors='coerce')
the_titanic_df['age'] = non_numeric_values

mean_age = int(the_titanic_df['age'].mean())
the_titanic_df['age'] = the_titanic_df['age'].fillna(mean_age)
the_titanic_df

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
0,1,3,0,Mr. Anthony,male,42.0,0,7.55,NaN,01-Jan-90
2,2,3,0,Master. Eugene Joseph,male,29.0,2,20.25,S,02-Jan-90
3,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,29.0,2,**,S,03-Jan-90
4,4,3,1,"Abbott, Mr. Rossmore Edward",female,35.0,2,20.25,S,04-Jan-90
5,5,3,1,"Abelseth, Miss. Karen Marie",female,16.0,0,7.65,S,05-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1296,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,0,13,S,19-Jul-93
1297,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1298,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1299,1299,3,0,"Zakarian, Mr. Ortin",male,27.0,0,7.225,C,22-Jul-93
1300,1300,3,0,"Zimmerman, Mr. Leo",male,29.0,0,7.875,S,23-Jul-93

In [ ]:
df = the_titanic_df.drop_duplicates('name')

In [ ]:
non_numeric_values_fare = pd.to_numeric(the_titanic_df['fare'], errors='coerce')
the_titanic_df['fare'] = non_numeric_values_fare
mean_fare = int(the_titanic_df['fare'].mean())

the_titanic_df['fare'] = the_titanic_df['fare'].fillna(mean_fare)
the_titanic_df['gender'] = the_titanic_df['gender'].fillna("male")

mode_embark = the_titanic_df['embarked'].mode()
the_titanic_df['embarked'] = the_titanic_df['embarked'].fillna(mode_embark)
the_titanic_df



non_numeric_values_fam = pd.to_numeric(the_titanic_df['family'], errors='coerce')
the_titanic_df['family'] = non_numeric_values_fam
mode_family = the_titanic_df['family'].mode()
the_titanic_df['family'] = the_titanic_df['family'].fillna(mode_family)

In [ ]:
the_titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1300 entries, 0 to 1300
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sn        1300 non-null   object
 1   pclass    1300 non-null   object
 2   survived  1300 non-null   object
 3   name      1300 non-null   object
 4   gender    1300 non-null   object
 5   age       1300 non-null   float64
 6   family    1298 non-null   float64
 7   fare      1300 non-null   float64
 8   embarked  1296 non-null   object
 9   date      1300 non-null   object
dtypes: float64(3), object(7)
memory usage: 111.7+ KB

In [ ]:
the_titanic_df['embarked'].value_counts(dropna=False)

embarked
S      906
C      267
Q      123
NaN      4
Name: count, dtype: int64

In [ ]:
the_titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1300 entries, 0 to 1300
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sn        1300 non-null   object
 1   pclass    1300 non-null   object
 2   survived  1300 non-null   object
 3   name      1300 non-null   object
 4   gender    1300 non-null   object
 5   age       1300 non-null   float64
 6   family    1298 non-null   float64
 7   fare      1300 non-null   float64
 8   embarked  1296 non-null   object
 9   date      1300 non-null   object
dtypes: float64(3), object(7)
memory usage: 111.7+ KB

### EXPLORATORY DATA ANALYSIS

In [ ]:
the_titanic_df.describe()

0              age       family         fare
count  1300.000000  1298.000000  1300.000000
mean     29.775323     0.890601    33.481048
std      12.867069     1.588428    51.875906
min       0.170000     0.000000     0.000000
25%      22.000000     0.000000     7.895800
50%      29.000000     0.000000    14.458300
75%      35.000000     1.000000    31.387500
max      80.000000    10.000000   512.329200

In [ ]:
#finding info from categorical data
the_titanic_df.describe(include=['O'])

,sn,pclass,survived,name,gender,embarked,date
count,1300,1300,1300,1300,1300,1296,1300
unique,1300,3,2,1297,2,3,1300
top,1,3,0,"Abbott, Mr. Rossmore Edward",male,S,01-Jan-90
freq,1,699,800,2,835,906,1

In [ ]:
the_titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1300 entries, 0 to 1300
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sn        1300 non-null   object
 1   pclass    1300 non-null   object
 2   survived  1300 non-null   object
 3   name      1300 non-null   object
 4   gender    1300 non-null   object
 5   age       1300 non-null   float64
 6   family    1298 non-null   float64
 7   fare      1300 non-null   float64
 8   embarked  1296 non-null   object
 9   date      1300 non-null   object
dtypes: float64(3), object(7)
memory usage: 111.7+ KB

In [ ]:
the_titanic_df['survived'] = pd.to_numeric(the_titanic_df['survived'], errors='coerce')

In [ ]:
the_titanic_df.groupby(['pclass'], as_index=False)['survived'].mean()

  pclass  survived
0      1  0.619195
1      2  0.428058
2      3  0.258941

In [ ]:
the_titanic_df.groupby(['gender'], as_index=False)['survived'].mean()

   gender  survived
0  female  0.729032
1    male  0.192814

In [ ]:
the_titanic_df.groupby(['fare'], as_index=False)['survived'].mean()

         fare  survived
0      0.0000  0.117647
1      3.1708  1.000000
2      4.0125  0.000000
3      5.0000  0.000000
4      6.2375  0.000000
..        ...       ...
276  227.5250  0.600000
277  247.5208  0.666667
278  262.3750  0.857143
279  263.0000  0.666667
280  512.3292  1.000000

[281 rows x 2 columns]

In [ ]:
the_titanic_df.groupby(['age'], as_index=False)['survived'].mean()

      age  survived
0    0.17  1.000000
1    0.67  1.000000
2    0.75  0.666667
3    0.83  1.000000
4    0.92  1.000000
..    ...       ...
91  70.50  0.000000
92  71.00  0.000000
93  74.00  0.000000
94  76.00  1.000000
95  80.00  1.000000

[96 rows x 2 columns]

In [ ]:
the_titanic_df.groupby(['sn'], as_index=False)['survived'].mean()

        sn  survived
0        1       0.0
1       10       1.0
2      100       1.0
3     1000       0.0
4     1001       1.0
...    ...       ...
1295   995       0.0
1296   996       0.0
1297   997       1.0
1298   998       0.0
1299   999       1.0

[1300 rows x 2 columns]

In [ ]:
plt.figure(figsize=(10, 6))
sns.histplot(the_titanic_df['age'].dropna(), kde=True, color='blue', bins=30)
plt.title('Age Distribution of Passengers')
plt.xlabel('Age')
plt.ylabel('Frequency')
plt.show()

NameError: name 'plt' is not defined